export const responses = {
    start: 'Привет! Я чат-бот автопарка "Центральный".\nНажимайте на кнопки)',
    workSchedule: 'График работы офиса:\nПонедельник - Пятница\nс 9-00 до 19-00\nСуббота - Воскресенье\nс 10-00 до 17-00',
    contacts: '33-55-66 (+79278335566)',
    dtp: 'Если попали в ДТП:\n1. Позвоните Рузалю Габдрахманнову\n2. Вызовите Аварийных комиссаров 902-902',
    office: 'График работы офиса:\nПонедельник - Пятница\nс 9-00 до 19-00\nСуббота - Воскресенье\nс 10-00 до 17-00\n\nПо адресу:\nг. Йошкар-Ола, Козьмодемьянский тракт 127\nТел.: 33-55-66 (+79278835566)',
    backToMain: 'Выберите действие:',
    writeToManager: 'Для связи с менеджером напишите: @yotaxi'
};